In [2]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\fahri\anaconda3\lib\site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

In [33]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

In [34]:
engine = create_engine(f"postgresql://neondb_owner:npg_f1uYCZ8nRWzQ@ep-floral-lake-a533zre9-pooler.us-east-2.aws.neon.tech/Air-Pollution-Seoul?sslmode=require")

# Extract.py

In [35]:
def get_data_from_db(query):
    '''
    Fungsi ini ditujukan untuk mengambil file dari SQL cloud untuk selanjutnya di load ke pandas

    Parameters:
        query       : SQL query (engine: import dari sqlalchemy)
    
    Return:
        df          : csv dari SQL yang telah diload ke pandas dataframe

    Contoh penggunaan:
        query = "SELECT * FROM customers"
        df = get_data_from_db(query)
    '''
    try:
        df = pd.read_sql(query, engine)
        return df
    except Exception as e:
        print(e)

# Transform.py

# Load.py

In [ ]:
def load_data_to_db(df, table_name):
    '''
    Fungsi ini ditujukan untuk load dataframe ke SQL cloud

    Parameters:
        df         : nama dataframe hasil transform (engine: import dari sqlalchemy)
        table_name : nama tabel di database yang akan dituju oleh df

    Contoh penggunaan:
    
    '''
    try:
        df.to_sql(table_name, engine, if_exists="overwrite", index=False) # ? overwrite atau append?
    except Exception as e:
        raise HTTPException(status_code=500, detail=str(e))

-----------------------------------------------------------
# Staging 1 (testing etl function)

## Extract

In [40]:
query = '''SELECT * FROM "Dim_Item";'''
df_item = get_data_from_db(query)
df_item.sample(1)

   Item_Code Item_Name Unit_Of_Measurement  Good  Normal   Bad  Very_Bad
2          5        CO                 ppm   2.0     9.0  15.0      50.0

In [41]:
query = '''SELECT * FROM "Dim_Station";'''
df_station = get_data_from_db(query)
df_station.sample(1)

,Station_Code,Station_Name,Address,Latitude,Longitude
19,120,Dongjak-gu,"6, Sadang-ro 16a-gil, Dongjak-gu, Seoul, Repub...",37.480917,126.971481

In [43]:
query = '''SELECT * FROM "Dim_Date";'''
df_date = get_data_from_db(query)
df_date.sample(1)

,id,Timetable,Year,Month,Day,DayOfWeek,WeekOfYear,Hour,Quarter,Half
259613,259614,2046-08-14 05:00:00,2046,8,14,1,33,5,3,2

In [44]:
query = '''SELECT * FROM "Fact_Info";'''
df_measurement = get_data_from_db(query)
df_measurement.sample(1)

              id    Measurement_Date  Station_Code  Item_Code  Average_Value
2788869  2788870 2019-02-14 17:00:00           111          8           53.0

In [45]:
df_measurement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3885066 entries, 0 to 3885065
Data columns (total 5 columns):
 #   Column            Dtype
---  ------            -----
 0   id                int64
 1   Measurement_Date  datetime64[ns]
 2   Station_Code      int64
 3   Item_Code         int64
 4   Average_Value     float64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 148.2 MB

## Transform

------------------------------------------------------------------
# Staging 2 (raw)

In [24]:
conn = psycopg2.connect(
    "postgresql://neondb_owner:npg_f1uYCZ8nRWzQ@ep-floral-lake-a533zre9-pooler.us-east-2.aws.neon.tech/Air-Pollution-Seoul?sslmode=require"
)

cur = conn.cursor()
cur.execute('''SELECT * FROM "Dim_Item";''')
rows = cur.fetchall()
print(rows)

[(1, 'SO2', 'ppm', Decimal('0.02'), Decimal('0.05'), Decimal('0.15'), Decimal('1.0')), (3, 'NO2', 'ppm', Decimal('0.03'), Decimal('0.06'), Decimal('0.2'), Decimal('2.0')), (5, 'CO', 'ppm', Decimal('2.0'), Decimal('9.0'), Decimal('15.0'), Decimal('50.0')), (6, 'O3', 'ppm', Decimal('0.03'), Decimal('0.09'), Decimal('0.15'), Decimal('0.5')), (8, 'PM10', 'Mircrogram/m3', Decimal('30.0'), Decimal('80.0'), Decimal('150.0'), Decimal('600.0')), (9, 'PM2.5', 'Mircrogram/m3', Decimal('15.0'), Decimal('35.0'), Decimal('75.0'), Decimal('500.0'))]

In [23]:
#rows

In [10]:
conn = psycopg2.connect("postgresql://neondb_owner:npg_f1uYCZ8nRWzQ@ep-floral-lake-a533zre9-pooler.us-east-2.aws.neon.tech/Air-Pollution-Seoul?sslmode=require")
cur = conn.cursor()
cur.execute(
    """
    SELECT table_name 
    FROM information_schema.tables 
    WHERE table_schema = 'public';
    """)
tables = cur.fetchall()
print(tables)

[('Dim_Date',), ('Fact_Info',), ('Dim_Item',), ('Dim_Station',)]

In [21]:
tables

[('Dim_Date',), ('Fact_Info',), ('Dim_Item',), ('Dim_Station',)]

In [ ]:
import os
print(os.path.exists(r"C:\Users\fahri\Downloads\postgresql-42.6.0.jar"))

True